[
  {
    "name": "Registration & Continental Breakfast",
    "description": "Registration will begin at 8:45am. Please arrive promptly for opening announcements at 9:30am.",
    "startTime": "8:45",
    "endTime": "9:30"
  },
  {
    "name": "Welcome to Container Camp",
    "startTime": "9:30",
    "endTime": "9:40"
  },
  {
    "name": "Bryan Cantrill",
    "twitter": "bcantrill",
    "talk": "Towards a Containerized Future",
    "description": "",
    "title": "CTO at [Joyent](https://www.joyent.com/)",
    "bio": "Bryan Cantrill is the CTO at [Joyent](https://www.joyent.com/), where he oversees worldwide development of the Triton Elastic Container Service and the Node.js platform. Bryan is a noted advocate for infrastructure containers and for open source technology, in part why he joined Joyent, where containers have been running securely in production at scale for over eight years. Prior to joining Joyent, Bryan served as a Distinguished Engineer at [Sun Microsystems](http://www.oracle.com/us/sun/), where he co­-designed and implemented [DTrace](https://en.wikipedia.org/wiki/DTrace), a facility for dynamic instrumentation of production systems that won the Wall Street Journal's top Technology Innovation Award in 2006.",
    "img": "bryan-cantrill.jpg",
    "startTime": "9:40",
    "endTime": "10:05"
  },
  {
    "name": "Shannon Williams",
    "title": "Co-founder and VP at [Rancher Labs](http://rancher.com/)",
    "talk": "Introducing the Private Container Service",
    "description": "Containers are all the rage among developers and web companies, but they also represent two very substantial benefits to teams and larger organizations. First, they have the potential to dramatically accelerate the application lifecycle from software builds and testing to deployment and upgrades. Second they represent the first truly hybrid-approach to consuming infrastructure, allowing organizations to run the same workloads on any cloud, virtual machine or physical server. Together, they represent a very real opportunity for faster development and cheaper operations, without many of the limitations of existing PaaS platforms. In this session, we’ll introduce the concept of the private Container Service, an enterprise-grade platform that runs and manages containers across any computing platforms.",
    "twitter": "smw355",
    "bio": "Shannon Williams is a co-founder and Vice President at [Rancher Labs](http://rancher.com/). Prior to starting Rancher, Shannon was a co-founder at [Cloud.com](http://www.cloud.com/) (acquired by Citrix), where he led worldwide sales. He has more than 15 years of experience in developing emerging technology at startups including Solidcore Systems (acquired by McAfee), Teros (acquired by Citrix) and Securant Technologies (acquired by RSA).",
    "img": "shannon-williams.jpg",
    "startTime": "10:05",
    "endTime": "10:30"
  },
  {
    "name": "Coffee Break",
    "startTime": "10:30",
    "endTime": "11:00"
  },
  {
    "name": "Mandy Waite",
    "title": "Developer advocate at [Google](http://www.google.com/)",
    "talk": "Kubernetes: Changing the way that we think and talk about computing",
    "description": "We're looking at a major revolution in Cloud Computing, the likes of Docker, CoreOS, Mesos, Kubernetes and many other technologies are not only changing the way we harness our computing power but are also changing the way that we talk about it. In this session we'll look at the new metaphors of computing through the lens of Kubernetes. We'll make use of the Kubernetes API and visualization libraries to get to a better understanding of the underlying mechanics of Kubernetes, we'll build clusters, schedule pods, group containers and expose services, and we'll visually demonstrate how they are all wired together.",
    "twitter": "tekgrrl",
    "bio": "Based in London, UK, Mandy is a Developer Relations Engineer at Google specializing in Container and Cloud technologies and working to make the world a better place for developers building applications for the Cloud. Before Google Mandy worked at Sun Microsystems on performance and scalability of Java and JavaEE and on porting Open Source apps to OpenSolaris. In her spare time Mandy is learning Japanese and likes to play the guitar.",
    "img": "mandy-waite.jpg",
    "startTime": "11:00",
    "endTime": "11:25"
  },
  {
    "name": "Bryan Boreham",
    "title": "Engineer at [Weaveworks](http://weave.works/)",
    "talk": "Distributed systems with (almost) no consensus",
    "description": "Container control systems are often based on distributed-consensus stores like Consul or Etcd, but they impose overheads that may not be justified for every task. Learn how Weaveworks implemented IP Address Management using a conflict-free replicated data type (CRDT) to deliver improved availability, performance and flexibility.",
    "twitter": "bboreham",
    "bio": "Bryan Boreham is a member of the engineering team at Weaveworks, delivering Open Source tools to connect, observe and control Docker containers. Bryan has extensive experience in building distributed systems at small and large scale, from computer conferencing to electronic trading.",
    "img": "bryan-boreham.jpg",
    "startTime": "11:25",
    "endTime": "11:50"
  },
  {
    "name": "Stéphane Graber",
    "title": "LXD Project Lead at [Canonical](http://www.canonical.com/)",
    "talk": "An introduction to LXD, the container lighter-visor",
    "description": "LXD is a new container manager, developed on top of the great LXC library by the same development team as LXC itself. It's designed to be fast, safe by default, work transparently across the network and provide a great user experience, whether it be used on a single laptop or on a large cluster. This talk will go over what LXD is, why it came to be, what it's doing today and where we're taking it.",
    "twitter": "stgraber",
    "bio": "Stéphane Graber works at Canonical as the technical lead for LXD and other containers projects. He's one of the two project leaders for all linuxcontainers.org projects, including LXC, LXD, LXCFS and CGManager. Outside of his work with containers, Stéphane is also an active Ubuntu core developer and sits on the Ubuntu Technical Board. On his spare time, he leads the infrastructure team of NorthSec, one of North America's largest on-site security contests (CTF - Capture The Flag), organized yearly in Montreal. It goes without saying that NorthSec's infrastructure is entirely container-based and runs on Ubuntu.",
    "img": "stephane-graber.jpg",
    "startTime": "11:50",
    "endTime": "12:15"
  },
  {
    "name": "Sysdig Lunch and Lightning Talks (1pm)",
    "startTime": "12:15",
    "endTime": "13:45"
  },
  {
    "name": "Arjan Schaaf",
    "title": "DevOps Architect at [Luminis Technologies](http://luminis-technologies.com/)",
    "talk": "Docker network performance in the public cloud",
    "description": "After we setup our initial Kubernetes+CoreOS based cluster on Azure using Weave, we asked ourselves the question: but what about performance? It turned out that different public clouds such as Azure and AWS but also the network implementation you choose for your Docker cluster has a significant impact on the networking performance of your cluster. In this talk I'll address how ran our performance tests on the different setups and the new libnetwork stack in the Docker experimental channel will be discussed as it offers new possibilities to easily swap the included network \"batteries\" by another implementation.",
    "twitter": "arjanschaaf",
    "bio": "Arjan has been developing modular and web applications using Java, OSGi and Groovy for years as a software engineer and architect. As a DevOps architect, Arjan has shift his focus to bringing development, operations and business together. Arjan has a passion for bringing the work of many people together in the Cloud and making it run secure and reliable, using the latest offerings the public cloud and the Linux Container Ecosystem.",
    "img": "arjan-schaaf.jpg",
    "startTime": "13:45",
    "endTime": "14:10"
  },
  {
    "name": "Alissa Bonas",
    "title": "Software Engineer at [Red Hat](http://www.redhat.com/en)",
    "talk": "Managing Kubernetes and OpenShift with ManageIQ",
    "description": "Kubernetes presents many challenges to the IT person that needs to deploy and administer the cluster and the containers on it. This session will cover how the open source ManageIQ project covers the lifecycle of Kubernetes and OpenShift, and allows a clear view on the system's various layers by showing what runs on each node, relationships between entities, all while still abstracting the different container technologies and terminology for the administrator.",
    "twitter": "mikeyteva",
    "bio": "Alissa Bonas is a software engineer and a team lead in the container management initiative in Red Hat, and a contributor and maintainer in several open source projects. She has a great interest in usability topics and participates in the [Rails Girls](http://railsgirls.com/) initiative as a coach.",
    "img": "alissa-bonas.jpg",
    "startTime": "14:10",
    "endTime": "14:35"
  },
  {
    "name": "Miek Gieben",
    "title": "Infrastructure Engineer at [Improbable](http://improbable.io/)",
    "talk": "Leveraging the DNS for fun and profit",
    "description": "At Improbable.io we are building a Reactive Infrastructure at scale. We are doing this by leveraging etcd and the DNS and making all aspect of our stack dynamic. In this talk I want to delve into how Improbable.io uses that setup and how it provides us with load-balancing, service discovery, monitoring and health checking, allowing us to build a complete multi-cluster stack in just 3 months.",
    "twitter": "miekg",
    "bio": "Miek Gieben is a member of the Infrastructure team at [Improbable.io](http://improbable.io/), where he creates and manages the cloud clusters that run Improbable's simulation software. As an ex-Google SRE Miek has plenty of knowledge of running scalable services. Together with a background in the DNS protocol this allowed him to write scalable service discovery servers like SkyDNS. As a fan of the Go language he is leading the charge inside Improbable to move most microservices to it. He also actively contributes to the open source ecosystem around the Go language in his spare time.",
    "img": "miek-gieben.jpg",
    "startTime": "14:35",
    "endTime": "15:00"
  },
  {
    "name": "Coffee Break",
    "startTime": "15:00",
    "endTime": "15:30"
  },
  {
    "name": "Ben Hall",
    "title": "Founder at [Ocelot Uproar](https://twitter.com/ocelotuproar)",
    "talk": "Lessons from running potentially malicious code inside containers",
    "description": "Scrapbook provides an online learning environment and hands-on labs built on top of Docker. To create an interactive learning environment, Scrapbook offers personalised sandboxed environments as learning playgrounds. A side effect is that users can execute malicious code and hack the system from inside the container. In this talk, Ben will share the lessons learned of building Scrapbook, Docker security and the solutions put in place. This talk will give insight into: - Out of the box security with Docker - Docker and Linux security issues - Monitoring for malicious activity - What happens when it all goes wrong.",
    "twitter": "ben_hall",
    "bio": "Ben is the founder of Ocelot Uproar, a company focused on building products loved by users while helping other companies succeed with building their own businesses. He has worked as systems administrator, tester and developer, finding time to become a published author and conference speaker. Ben continues to look for the next challenge to solve, generally over a beer.",
    "img": "ben-hall.jpg",
    "startTime": "15:30",
    "endTime": "15:55"
  },
  {
    "name": "Diogo Mónica",
    "title": "Security Lead at [Docker](https://www.docker.com/)",
    "talk": "A Docker image walks into a Notary",
    "description": "Secure software distribution is a hard problem. A testament to this fact are the thousands of different software update systems in use today, most of which vulnerable to a myriad of attacks that leave the end users potentially vulnerable to compromise. With the explosion in popularity of containers, more and more software is being distributed in the form of a Docker image. This gives us the unique opportunity to leapfrog the status quo, and create a better way to ensure the security of software distribution. Enter Notary, an application built at Docker that aims to make the internet more secure by making it easy for people to publish and verify content. Notary follows a flexible security framework called TUF (The Update Framework), allowing publishers to sign their content offline and manage their keys securely. In this talk I will go over Notary, its security guarantees, TUF and how we’ve integrated it into Docker 1.8 to provide content trust.",
    "twitter": "diogomonica",
    "bio": "Diogo Mónica is the Security Lead at Docker, an open platform for building, shipping and running distributed applications. He was an early employee at Square where he led the platform security team. He received his BSc and MSc degrees in Communication Networks Engineering and is currently a Security Researcher at the distributed systems group. Diogo also serves on the board of advisors of several security startups and is a long-time IEEE Volunteer.",
    "img": "diogo-monica.jpg",
    "startTime": "15:55",
    "endTime": "16:20"
  },
  {
    "name": "Coffee Break",
    "startTime": "16:20",
    "endTime": "16:50"
  },
  {
    "name": "Loris Degioanni",
    "twitter": "lorisdegio",
    "title": "CEO at [Sysdig](http://www.sysdig.org/)",
    "talk": "The Dark Art of Container Monitoring",
    "description": "Containers are revolutionizing the way we deploy and maintain our infrastructures, but monitoring and troubleshooting in a containerized environment can still be painful and impractical. Understanding even basic resource usage is difficult - let alone tracking network connections or malicious activity. This talk will cover the current state of the art for container monitoring and visibility, including pros / cons and live demonstrations of each method. Special emphasis will be put on sysdig, an open source troubleshooting tool authored by the presenter. Sysdig offers unprecedented container visibility without the need to break the “sanctity” of the container.",
    "bio": "Loris Degioanni is the CEO and founder of [Sysdig](http://www.sysdig.com/), Inc. and the original creator of the popular open source troubleshooting tool, sysdig. Prior to founding Sysdig, Loris was a Senior Director of Technology at Riverbed Technology. He has also been a pioneer in the field of open source network analysis through his work on [WinPcap](http://www.winpcap.org/) and [Wireshark](https://www.wireshark.org/). Loris holds a PhD in computer engineering from Politecnico di Torino and lives in Davis, California.",
    "img": "loris-degioanni.jpg",
    "startTime": "16:50",
    "endTime": "17:15"
  },
  {
    "name": "Juan Batiz-Benet",
    "title": "Founder at [Protocol Labs](http://ipn.io/)",
    "talk": "Containers at Hyperspeed",
    "description": "Containers are awesome! But storing and moving them is painful! It's slow! Containers are huge! There's little deduplication! No cryptographic versioning! Images are lost! Worst, we must depend on other services -- or having fast connection to them... No more! `starship` puts your containers on hyperspeed! Instead of old-school HTTP, `starship` uses shiny IPFS -- a new protocol, Git meets Bittorrent. With IPFS, `starship` (a) deduplicates all data between containers, (b) uses p2p download from fastest hosts, and (c) can limit connections to private cloud(s) or local networks. (release + demo `starship` -- an internal tool. introduces IPFS for context)",
    "twitter": "juanbenet",
    "bio": "Juan is the inventor of IPFS, Filecoin, and other protocols. He is the Founder of Protocol Labs (S14 YC), a company improving how we store and transfer information. Juan loves Open Source. Previously, he worked on knowledge distribution tools, he cofounded Loki Studios, and studied Computer Science at Stanford University.",
    "img": "juan-benet.jpg",
    "startTime": "17:15",
    "endTime": "17:40"
  },
  {
    "name": "Thank You",
    "startTime": "17:40",
    "endTime": "17:45",
    "hideTime": "true"
  },
  {
    "name": "After Party",
    "startTime": "17:45",
    "endTime": "21:00",
    "hideTime": "true"
  }
]